app/Http/Controllers/Website/PostController.php

    public function dopost(Request $request)
    {
        Post::create([
            'title'=>$request->input('title'),
            'messege'=>$request->input('messege'),
            'user_id'=>auth()->user()->id
        ]);
        return redirect()->back()->with('message','Post created.');
---
select * from `posts`

    public function viewpost()
    {
        $now = Carbon::now();

        $post=Post::with('user')->get();
        // dd($post);
        foreach($post as $key => $dpost){
            $delete_post = $dpost->created_at;
            // dd($delete_post);
            $comments = Commnet::where('post_id',$dpost->id)->get();
            $diffInHoure = Carbon::parse($delete_post);
            // dd($diffInHoure);
            $length = $diffInHoure->diffInHours($now);
            // dd($length);
            if($length>=4){
                foreach ($comments as $key => $comment) {
                    $comment->delete();
                }
                $dpost->delete();
---
select * from `posts` where `posts`.`deleted_at` is null
select * from `users` where `users`.`id` in (6)
update `posts` set `deleted_at` = '2022-01-25 05:23:25', `posts`.`updated_at` = '2022-01-25 05:23:25' where `id` = 3