app/Http/Controllers/Website/RequestController.php

    public function dorequest(Request $request)
    {
        // dd($request->all());
        // $newamount=0;
        $id = $request->stock_id;
        // dd($decrease);
        // $currentamount = $decrease->in_stock;
        // $requestedAmmount = $request->amount;
        // if ($currentamount >= $requestedAmmount) {
        //     $newamount = $currentamount-$requestedAmmount;
        //     // dd($newamount);
        // }
        $stock = add_new_stock::find($id);
        if ($stock->in_stock >= $request->amount) {
             $bloodrequest=bloodrequest::create([
                'user_id'=>$request->user_id,
                'stock_id'=>$request->stock_id,
                'amount'=>$request->amount
            ]);
            $decrease= add_new_stock::where('id',$id)->decrement('in_stock',$bloodrequest->amount);
---
update `add_new_stocks` set `in_stock` = `in_stock` - 5, `add_new_stocks`.`updated_at` = '2022-01-29 05:54:30' where `id` = '11'