app/Http/Controllers/Backend/RegistrationapprovalController.php

    public function approve()
    {
        $userdata=User::where('active','0')->get();
---
select * from `users` where `active` = '0'