app/Http/Controllers/Backend/StockController.php

     public function stockdelete($id)
    {
       // dd($id);
       add_new_stock::find($id)->delete();
---
delete from `add_new_stocks` where `id` = 5