app/Http/Controllers/Backend/UserController.php

    public function userlist()
    {
        $userdata=User::all();
---
select * from `users`